//
//  HelperDataPromotions.swift
//  CoffeLife
//
//  Created by mac on 25.05.2021.
//

import Foundation

var promotionsData = [Promotion(promoImage: "promo1", promoName: "Друзья друзей - наши друзья!",
                            promoDescription: "Пригласите друзей зарегистрироваться в приложении по вашему уникальному коду и получите бонусы.",
                            promoFullDescription: "Отправьте друзьям уникальный код для регистрации в приложении. Как только 5 друзей зарегистрируются и совершат первую покупку, вам начислятся 100 бонусов в подарок"),
                  Promotion(promoImage: "promo2", promoName: "Для тех, у кого скоро праздник!",
                            promoDescription: "При совершении покупок в день Рождения и 6 дней после него вы получаете повышенный бонус 20%.",
                            promoFullDescription: "При совершении покупок в день Рождения и 6 дней после него вы получаете повышенный бонус 20%. Бонус начисляется вне зависимости от вашего текущего уровня."),
                  Promotion(promoImage: "promo3", promoName: "Раф в подарок любимому Гостю",
                            promoDescription: "Часто у нас бываете? Получите раф в подарок!",
                            promoFullDescription: "Купите 10 любых напитков в течение 2 месяцев и получите промокод на раф объемом М из классического меню. Спасибо, что вы с нами! \n\nСрок действия промокода - 7 дней."),
                  Promotion(promoImage: "promo4", promoName: "Вы любите нас, а мы ваши отзывы",
                            promoDescription: "Получите скидку 10% за отзыв о напитках COFFEE LIFE в социальных сетях и отзовиках.",
                            promoFullDescription: "Хотите рассказать своим друзьям о вашем любимом напитке и получить скидку? У вас есть такая возможность! \n\n\nКак все работает: \n\nОпубликуйте отзыв о любимом напитке \n\nПокажите его бариста \n\nПолучите любой напиток из классического меню со скидкой 10%")

]
